# MaterialClass Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..MaterialClass Property
Material Class See Also
---
The name of the general material type, e.g. 'Wood.'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string MaterialClass { get; set; }
```

Visual Basic
---
```text
Public Property MaterialClass As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ MaterialClass {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace